export interface SubscriptionPlan {
    id: string;
    title: string;
    description: string;
    features: string[];
    price: string;
}

export const mockPlans: SubscriptionPlan[] = [
    {
        id: "standard",
        title: "Стандарт",
        description: "Отримай все для ефективного тренування!",
        features: ["Безлімітний доступ до тренувальної зони", "Гнучкий графік відвідувань"],
        price: "800 грн/місяць",
    },
    {
        id: "premium",
        title: "Преміум",
        description: "Отримай максимум для досягнення фітнес-цілей!",
        features: [
            "Безлімітний доступ до тренувальної зони",
            "Заняття з груповим тренером",
            "Персональна консультація тренера",
        ],
        price: "1200 грн/місяць",
    },
    {
        id: "vip",
        title: "VIP",
        description: "Отримай повний контроль над своїм тренуванням!",
        features: [
            "Безкоштовні персональні тренування (2 рази на місяць)",
            "Доступ до VIP-зони клубу та спеціальних знижок",
        ],
        price: "1800 грн/місяць",
    },
    {
        id: "student",
        title: "Студентський",
        description: "Спеціальна пропозиція для студентів!",
        features: ["Безлімітний доступ до тренувальної зони", "Гнучкий графік відвідувань"],
        price: "700 грн/місяць",
    },
    {
        id: "week",
        title: "Річний",
        description: "Отримай максимум можливостей цілий рік!",
        features: ["Безлімітний доступ до тренувальної зони", "Гнучкий графік відвідувань"],
        price: "7500 грн/рік",
    },
    {
        id: "oneDay",
        title: "Разовий",
        description: "Доступ до клубу для разового тренування.",
        features: ["Безлімітний доступ до тренувальної зони"],
        price: "700 грн",
    },
    {
        id: "corporate",
        title: "Корпоративний",
        description: "Спеціальна пропозиція для колективів.",
        features: [
            "Безлімітний доступ до тренувальної зони",
            "Заняття з тренером для групи",
        ],
        price: "5000 грн",
    },
];
